// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let firstNumber=+prompt('Введіть перше число')
// let secondNumber=+prompt('Введіть друге число')
// if(firstNumber>secondNumber){
//     console.log(`${firstNumber}-максимальне число`)
// }
// else if(firstNumber===secondNumber){
//     console.log('Числа рівні!')
// }
// else{
//     console.log(`${secondNumber}-максимальне число`)
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let flatNumber = +prompt('Введіть № квартири:')
// if (flatNumber > 0 && flatNumber <= 90) {
//     if (flatNumber <= 20) {
//         console.log(`Квартира №${flatNumber} знаходиться в першому під'їзді `)
//     } else if (flatNumber <= 48) {
//         console.log(`Квартира №${flatNumber} знаходиться в другому під'їзді `)
//     } else {
//         console.log(`Квартира №${flatNumber} знаходиться в третьому під'їзді `)
//     }
// } else {
//     console.log('В цьому домі немає квартири з таким номером!')
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('Введіть число:') === 10 ? console.log('ВІРНО') : console.log('НЕВІРНО');

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
// let x = 1;
// // let x = 'sdd';
// // let x = true;
// // let x = {name :'Slava', city: 'Lviv' };
// let x = [2,'sdsdad'];
// if (typeof (x) === "number") {
//     console.log(1);
// } else if (typeof (x) === "string") {
//     console.log(2);
// }
// else if (typeof (x) === "boolean") {
//     console.log(3);
// }
// else if (typeof (x) === "object") {
//     console.log(4);
// }
// else {
//     console.log('else');
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let temperature=+prompt('Скільки сьогодні градусів на вулиці?')
// if(temperature>=10 && temperature<=22){
//     console.log('Йдемо вчитися');
// }
// else{
//     console.log('сидимо вдома і вчимося ОНЛАЙН');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let luckyNumber=+prompt('Введіть число від 1 до 5:')
// switch (luckyNumber){
//     case 1:
//         console.log('Ваш приз: АВТОМОБИИИЛЬ!');
//         break;
//     case 2:
//         console.log('Ваш приз: Мото!');
//         break;
//     case 3:
//         console.log('Ваш приз: телефон!');
//         break;
//     case 4:
//         console.log('Ваш приз: блокнотик!');
//         break;
//     case 5:
//         console.log('Ви не виграли нічого. Наступного разу пощастить більше!');
//         break;
//     default:
//         console.log('Ви ввели невірне число!Введіть число від 1 до 5.')
// }
