// - Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
//     Вивести кожну змінну за допомогою: console.log , alert, document.write
// let q='hello';
// console.log(q);
// alert(q);
// document.write(q);
// //----------------------------------------------------
// let w='owu';
// console.log(w);
// alert(w);
// document.write(w);
// //----------------------------------------------------
// let e='com';
// console.log(e);
// alert(e);
// document.write(e);
// //----------------------------------------------------
// let r='ua';
// console.log(r);
// alert(r);
// document.write(r);
// //----------------------------------------------------
// let t=1;
// console.log(t);
// alert(t);
// document.write(t);
// //----------------------------------------------------
// let y=10;
// console.log(y);
// alert(y);
// document.write(y);
// //----------------------------------------------------
// let u=-999;
// console.log(u);
// alert(u);
// document.write(u);
// //----------------------------------------------------
// let i=123;
// console.log(i);
// alert(i);
// document.write(i);
// //----------------------------------------------------
// let o=3.14;
// console.log(o);
// alert(o);
// document.write(o);
// //----------------------------------------------------
// let p=2.7;
// console.log(p);
// alert(p);
// document.write(p);
// //----------------------------------------------------
// let a=16;
// console.log(a);
// alert(a);
// document.write(a);
// //----------------------------------------------------
// let s=true;
// console.log(s);
// alert(s);
// document.write(s);
// //----------------------------------------------------
// let d=false;
// console.log(d);
// alert(d);
// document.write(d);

//************************************************************

// - Переприсвоїти кожній змінній з завдання значення на довільне.
//     Вивести кожну змінну за допомогою: console.log , alert, document.write
//
// q = 'hi';
// console.log(q);
// alert(q);
// document.write(q)
// //----------------------------------------------------
// w = 1;
// console.log(w);
// alert(w);
// document.write(w)
// //----------------------------------------------------
// e = 'I';
// console.log(e);
// alert(e);
// document.write(e)
// //----------------------------------------------------
// r = false;
// console.log(r);
// alert(r);
// document.write(r)
// //----------------------------------------------------
// t = "like";
// console.log(t);
// alert(t);
// document.write(t)
// //----------------------------------------------------
// y = 1000000;
// console.log(y);
// alert(y);
// document.write(y)
// //----------------------------------------------------
// u = 87654;
// console.log(u);
// alert(u);
// document.write(u)
// //----------------------------------------------------
// i = "dsada2131234e1d";
// console.log(i);
// alert(i);
// document.write(i)
// //----------------------------------------------------
// o = -213;
// console.log(o);
// alert(o);
// document.write(o)
// //----------------------------------------------------
// p = 0.9999999999999;
// console.log(p);
// alert(p);
// document.write(p)
// //----------------------------------------------------
// a = 'pizza';
// console.log(a);
// alert(a);
// document.write(a)
// //----------------------------------------------------
// s = true;
// console.log(s);
// alert(s);
// document.write(s)
// //----------------------------------------------------
// d = false;
// console.log(d);
// alert(d);
// document.write(d)
// //----------------------------------------------------

//************************************************************

// // - Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ. З'єднати їх в одну змінну person. (Не об'єкт)
// let firstName="Vyacheslav";
// let middleName="Aleksandrovich"
// let lastName="Kolos";
// let person=lastName+" "+firstName+" "+middleName;
// console.log(person);

//************************************************************

// // - За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками.
// //     Вивести "Вітаю *Імя* *По батькові*. Тобі *вік* років".
// let name=prompt("Введіть своє Ім'я: ");
// let surname =prompt("Введіть своє ім'я По-Батькові: ");
// let age=prompt("Скільки вам років? ");
// alert(`Вітаю ${name} ${surname} Тобі ${age} Років`)

//************************************************************

// // - За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
// //     let a = 100; let b = '100'; let c = true;
// let a = 100;
// let b = '100';
// let c = true;
// console.log(typeof (a));
// console.log(typeof (b));
// console.log(typeof (c));

//************************************************************

// // - Визначити відповідний оператор в виразах що б вийшов відповідний результат.
// //     В однакових виразах не використовувати однакові оператори!!!
// //     5 ? 6 -> true
// // 5 ? 6 -> false
// // 5 ? 6 -> false
// // 5 ? 6 -> false
// // 10 ? 10 -> true
// // 10 ? 10 -> true
// // 10 ? 10 -> false
// // 10 ? 10 -> false
// // 10 ? 10 -> false
// // 123 ? '123' -> false
// // 123 ? '123' -> true
// 5 < 6
// 5 > 6
// 5 === 6
// 5 >= 6
//  10 <= 10
// 10 === 10
// 10 !== 10
// 10 > 10
// 10 < 10
// 123 === '123' ;
// 123 == '123';

//************************************************************

// // - Подумайте Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//     let str = "20";
// let a = 5;
// document.write(str + a + "<br/>"); //205 тому що стрічка заражає все інше і воно стає теж стрічкою
// document.write(str - a + "<br/>");  //15 тому що операція -(мінус) завжди перетворює стрічку в число
// document.write(str * "2" + "<br/>");  //40 тому що * завжди перетворює стрічку в число
// document.write(str / 2 + "<br/>"); //10 тому що /(ділення) завжди перетворює стрічку в число