// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length>=3){
//     console.log('це великий масив, в якому  3 і більше елементи')
// }
// else {
//     console.log('що це маленький масив, в якому менше 3-х елементів')
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let a = 0;
// let b = 15;
// let c = 5;
// b
// if (a === b || a === c || b === c) {
//     console.log('серед чисел є рівні, неможливо визначити те, що посередині')
// } else {
//     if (a > c && a < b || a > b && a < c) {
//         console.log('a-посередині')
//     } else if (b > a && b < c || b > c && b < a) {
//         console.log('b-посередині')
//     } else if (c > b && c < a || c > a && c < b) {
//         console.log('c-посередині')
//     }
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// let a1 = 2;
// let b1 = 1;
// // if (a1 + b1 < 4) {
// //     result = 'Мало';
// // } else {
// //     result = 'Багато';
// // }
//
// let result = (a1 + b1 < 4) ? 'Мало' : 'Багато';
// console.log(result);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let numb = +prompt('Введіть число від -100 , 0 , +100  ')
// let res = numb < 0 ? console.log('число негативне') : numb === 0 ? console.log('це число 0') : console.log('число позитивне');
